src/Catalogs/ИТСервисы_ИТСервисы/ИТСервисы_ИТСервисы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИТСервисы_ИТСервисы</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехПровайдер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РуководительСервиса</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВывода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийСервис</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Развитие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сопровождение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланПроектаВИСУП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВАРМРазработчика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрограммныеОбеспечения</name>
    <attributes>
      <name>ПрограммноеОбеспечение</name>
      <type>
        <types>CatalogRef.ИТСервисы_ПрограммныеОбеспечения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ИТСервисы_ЛицензииПО/ИТСервисы_ЛицензииПО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИТСервисы_ЛицензииПО</name>
  <attributes>
    <name>ПрограммноеОбеспечение</name>
    <type>
      <types>CatalogRef.ИТСервисы_ПрограммныеОбеспечения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЛицензирования</name>
    <type>
      <types>EnumRef.ИТСервисы_ТипыЛицензирования</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вендор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ИТСервисы_ИТСервисы/Forms/ФормаЭлемента/Form.bsl
&НаКлиенте
Процедура ДатаВыводаПриИзменении(Элемент)
	
	ПроверитьДаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗапускаПриИзменении(Элемент)
	
	ПроверитьДаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДаты()

	ДатаЗапуска = Объект.ДатаЗапуска;
	ДатаВывода = Объект.ДатаВывода;

	Если Не ДатаЗапуска = Неопределено И Не ДатаВывода = Неопределено Тогда
		Если ДатаВывода < ДатаЗапуска Тогда
			Сообщить("Дата вывода не может быть меньше даты запуска", СтатусСообщения.Внимание);
			Объект.ДатаВывода = ДатаЗапуска;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрограммныеОбеспеченияПрограммноеОбеспечениеПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ПрограммныеОбеспечения.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.ПрограммноеОбеспечение <> Неопределено Тогда
		ПроверитьЛицензиюПО(ТекущиеДанные.ПрограммноеОбеспечение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЛицензиюПО(ПрограммноеОбеспечение)

	РезультатПроверки = ПроверитьЛицензиюПОНаСервере(ПрограммноеОбеспечение);

	Если Не РезультатПроверки.ЕстьДействующаяЛицензия Тогда
		Если Не РезультатПроверки.ЕстьЛицензия Тогда
			ТекстСообщения = "Для программного обеспечения """ + ПрограммноеОбеспечение
				+ """ нет лицензии. Добавление невозможно.";
			ПоказатьПредупреждение(, ТекстСообщения, , "Добавление ПО");
		Иначе
			ТекстСообщения = "Для программного обеспечения """ + ПрограммноеОбеспечение
				+ """ срок действия всех лицензий истёк. Добавление невозможно.";
			ПоказатьПредупреждение(, ТекстСообщения, , "Добавление ПО");
		КонецЕсли;

		ТекущиеДанные = Элементы.ПрограммныеОбеспечения.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущиеДанные.ПрограммноеОбеспечение = Неопределено;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьЛицензиюПОНаСервере(Знач ПрограммноеОбеспечение)

	Результат = Новый Структура("ЕстьДействующаяЛицензия, ЕстьЛицензия", Ложь, Ложь);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИТСервисы_ЛицензииПО.Ссылка КАК Лицензия,
	|	ИТСервисы_ЛицензииПО.ДатаНачала КАК ДатаНачала,
	|	ИТСервисы_ЛицензииПО.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Справочник.ИТСервисы_ЛицензииПО КАК ИТСервисы_ЛицензииПО
	|ГДЕ
	|	ИТСервисы_ЛицензииПО.ПрограммноеОбеспечение = &ПрограммноеОбеспечение
	|	И НЕ ИТСервисы_ЛицензииПО.ПометкаУдаления";

	Запрос.УстановитьПараметр("ПрограммноеОбеспечение", ПрограммноеОбеспечение);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Результат.ЕстьЛицензия = Истина;

		ТекущаяДата = ТекущаяДатаСеанса();

		Если Выборка.ДатаНачала <> Неопределено И Выборка.ДатаОкончания <> Неопределено Тогда
			Если ТекущаяДата >= Выборка.ДатаНачала И ТекущаяДата <= Выборка.ДатаОкончания Тогда
				Результат.ЕстьДействующаяЛицензия = Истина;
				Прервать;
			КонецЕсли;
		ИначеЕсли Выборка.ДатаОкончания = Неопределено Тогда
			Если Выборка.ДатаНачала = Неопределено ИЛИ ТекущаяДата >= Выборка.ДатаНачала Тогда
				Результат.ЕстьДействующаяЛицензия = Истина;
				Прервать;
			Иначе
				Продолжить;
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции
